"use strict";

let sales = () => {
    return {
        a15d25e1: 10, // в процентах
        d137d16e: 15, // в процентах
        "936b4763": 30, // в процентах
    }
};

// TODO (1) при нажатии на контейнер отображать скидку и удалять обработчик события

// TODO (2) менять цвет фона body на выбранный пользователем
//  значение цвета - значение атрибута value радиокнопок

/* TODO (3) разблокировать поле, если чекбокс был отмечен */

/* TODO (4) собрать выбранные языки и страны в массив */

/* TODO (5) реализовать валидацию данных, вводимых пользователем в режиме реального времени */
