"use strict";
// TODO: Задание 1
// 1. объявить пустой объект, ссылку на него присвоить переменной userData
// 2. добавить в объект свойство name со значением Paul
// 3. добавить в объект свойство свойство age со значением 23
// 4. добавить в объект свойство favourite colors со значением  ["red", "orange", "yellow"]
// 5. вывести в консоль значение свойства age
// 6. вывести в консоль значение свойства name
// ---
// 7. вывести в консоль все цвета (использовать цикл)
// 8. задать цвет фона body (document.body.style.backgroundColor = цвет),
//    цвет должен выбираться случайным образом из свойства 'favourite colors'
// ---
// 9. объявить 2 объекта со свойствами title и pageCount
// - для первого объекта значение свойства title - "JavaScript", pageCount - 780,
//   ссылку на объект присвоить переменной jsBook
// - для второго объекта значение свойства title - "CSS 3", pageCount - 1200
//   ссылку на объект присвоить переменной cssBook
// 10. добавить объекту userData свойство favouriteBooks со значением -
//    массив, который содержит jsBook и cssBook
// 11. вывести объект userData в консоль
// 12. вывести в консоль стоимость последней книги из свойства favouriteBooks
// 13. вывести названия книг количество страниц которых больше 1000
// ---



// TODO: Задание 2
// запросить у пользователя код сообщения и вывести в консоль
// текст сообщений с кодом выше указанного
let messages = [
    {
        text: "vetu eiuviev",
        priority: "high",
        code: 120
    },
    {
        text: "kh ubyuiui biy",
        priority: "low",
        code: 231
    },
    {
        text: "poi yrvu crxw",
        priority: "low",
        code: 344
    }
];

